﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <IT8625Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_IT8625_SIO_FORM                        #language eng "IT8625 Super IO Configuration"
#string STR_IT8625_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_IT8625_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_IT8625                                 #language eng "IT8625"

//
//Parallel Settings
//
#string STR_IT8625_PARALLEL_IO378_IRQ5             #language eng "IO=378h; IRQ=5;"
#string STR_IT8625_PARALLEL_IO378_IRQX             #language eng "IO=378h; IRQ=5,6,7,9,10,11,12;"
#string STR_IT8625_PARALLEL_IO278_IRQX             #language eng "IO=278h; IRQ=5,6,7,9,10,11,12;"
#string STR_IT8625_PARALLEL_IO3BC_IRQX             #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12;"

#string STR_IT8625_PARALLELE_IO378_778_IRQ5_DMA3   #language eng "IO=378h; IRQ=5; DMA=3;"
#string STR_IT8625_PARALLELE_IO378_778_IRQX_DMAX   #language eng "IO=378h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_IT8625_PARALLELE_IO278_678_IRQX_DMAX   #language eng "IO=278h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_IT8625_PARALLELE_IO3BC_7BC_IRQX_DMAX   #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12; DMA=1,3;"

#string STR_IT8625_PARALLEL_MODE0                  #language eng "Standard Parallet Port mode(SPP)"
#string STR_IT8625_PARALLEL_MODE1                  #language eng "EPP Mode"
#string STR_IT8625_PARALLEL_MODE2                  #language eng "ECP Mode"
#string STR_IT8625_PARALLEL_MODE3                  #language eng "EPP mode & ECP mode"
#string STR_IT8625_PARALLEL_MODE_HELP              #language eng "Change the Printer Port mode."

//
//CIR Settings
//
#string STR_IT8625_CIR_FORM                        #language eng "CIR Controller Configuration"
#string STR_IT8625_CIR_FORM_HELP                   #language eng "Set Parameters of CIR Controller (CIR)"
#string STR_IT8625_CIR_PROMPT                      #language eng "CIR Controller"
#string STR_IT8625_CIR_PROMPT_HELP                 #language eng "Enable or Disable CIR Controller"
#string STR_IT8625_CIR_SETTINGS0                   #language eng "IO=3E0h; IRQ=10;"
#string STR_IT8625_CIR_SETTINGS1                   #language eng "IO=3E0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_IT8625_CIR_CONFIG_VALUE                #language eng "Reset Required"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
